# Nama : Muhammad Rifan Fathoni
# NIM : 2209106003
# Posttest 4 Kecerdasan Buatan A1-22

## Data Cleaning

In [64]:
from sklearn.impute import SimpleImputer
import pandas as pd

Keterangan : 
- Melakukan import SimpleImputer(sklearn.impute)
- melakukan import library pandas

In [65]:
df = pd.read_csv('Clean_Dataset_edit.csv')
df.head()

,Unnamed: 0,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1.0,5953
1,1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1.0,5953
2,2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1.0,5956
3,3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1.0,5955
4,4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1.0,5955

Keterangan : mengimport dataset dan disimpan dalam variable df

In [66]:
df = df.drop(columns=['Unnamed: 0'])
df.head()

,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,2.17,1.0,5953
1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,2.33,1.0,5953
2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,2.17,1.0,5956
3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,2.25,1.0,5955
4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,2.33,1.0,5955

Keterangan : menghilakan kolom unnamed: 0 karena isi datanya tidak berguna

### Mengatasi Nilai Null

Lakukan Data cleaning pada data dengan nilai null (jika tidak ada nilai null pada dataset, maka buatlah menjadi ada). Ganti nilai null sesuai ketentuan. (bilangan bulat : median/modus, bilangan desimal : mean, tulisan : modus). Nilai plus jika strategy yang digunakan menggunakan 3 nilai

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300154 entries, 0 to 300153
Data columns (total 11 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   airline           300154 non-null  object
 1   flight            300154 non-null  object
 2   source_city       300154 non-null  object
 3   departure_time    300154 non-null  object
 4   stops             300154 non-null  object
 5   arrival_time      300154 non-null  object
 6   destination_city  300154 non-null  object
 7   class             300153 non-null  object
 8   duration          300153 non-null  float64
 9   days_left         300153 non-null  float64
 10  price             300154 non-null  int64
dtypes: float64(2), int64(1), object(8)
memory usage: 25.2+ MB

Keterangan : melihat type data setiap kolom menggunakan fungsi info()

In [68]:
df.isnull().sum()

airline             0
flight              0
source_city         0
departure_time      0
stops               0
arrival_time        0
destination_city    0
class               1
duration            1
days_left           1
price               0
dtype: int64

Keterangan : melihat jumlah dari nilai null pada setiap kolom menggunakan fungsi isnull().sum()

In [69]:
df[['duration', 'days_left']] = df[['duration', 'days_left']].fillna(df[['duration', 'days_left']].mean())
df['class'] = df['class'].fillna(df['class'].mode()[0])

Keterangan :
- mengubah nilai null pada tipe data float dengan menggunakan nilai rata rata dari kolom tempat nilai null berada
- mengubah nilai null pada tipe data object dengan menggunakan nilai modua dari kolom tempat nilai null berada

In [70]:
df.isna().sum()

airline             0
flight              0
source_city         0
departure_time      0
stops               0
arrival_time        0
destination_city    0
class               0
duration            0
days_left           0
price               0
dtype: int64

Keterangan : melihat jumlah dari nilai null pada setiap kolom menggunakan fungsi isna().sum()

### Mengatasi Data Duplikat

Lakukan Data cleaning pada data dengan nilai duplikat. (Jika tidak ada nilai duplikat pada dataset, maka buatlah menjadi ada)

In [71]:
df.duplicated().sum()

1

Keterangan : melihat jumlah dari data yang duplikat pada dataset menggunakan fungsi duplicated().sum()

In [72]:
df = df.drop_duplicates()

Keterangan : menghilangkan data duplikat menggunakan fungsi drop_duplicates()

In [73]:
df.duplicated().sum()

0

Keterangan : melihat jumlah dari data yang duplikat pada dataset menggunakan fungsi duplicated().sum()

## Data Transformation

### Standarisasi

Lakukan standarisasi pada dataset (buatlah copy dataset terlebih dahulu)

In [74]:
from sklearn.preprocessing import StandardScaler

Keterangan : melakukan import StandardScaler(sklearn.preprocessing)

In [75]:
ss = StandardScaler()
dfs = df
dfs.dtypes

airline              object
flight               object
source_city          object
departure_time       object
stops                object
arrival_time         object
destination_city     object
class                object
duration            float64
days_left           float64
price                 int64
dtype: object

Keterangan :
- membuat variable ss sebagai alias fungsi StandardScaler()
- melakukan duplikat dataset kedalam variable dfs
- melihat type data pada setiap kolom

In [76]:
df[['duration', 'days_left', 'price']] = ss.fit_transform(df[['duration', 'days_left', 'price']])
df.head()

,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,-1.397540,-1.843891,-0.658068
1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,-1.375293,-1.843891,-0.658068
2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,-1.397540,-1.843891,-0.657936
3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,-1.386417,-1.843891,-0.657980
4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,-1.375293,-1.843891,-0.657980

Keterangan : Melakukan Standarisasi data pada kolom duration, days_left ,price

### Normalisasi

Lakukan normalisasi data pada salah satu attribute menggunakan Min Max scaler (buatlah copy dataset terlebih dahulu)

In [77]:
from sklearn.preprocessing import MinMaxScaler

Keterangan : melakukan import MinMaxScaler(sklearn.preprocessing)

In [78]:
mm = MinMaxScaler()
dfn = df
dfn.dtypes

airline              object
flight               object
source_city          object
departure_time       object
stops                object
arrival_time         object
destination_city     object
class                object
duration            float64
days_left           float64
price               float64
dtype: object

Keterangan :
- membuat variable mm sebagai alias fungsi MinMaxScaler()
- melakukan duplikat dataset kedalam variable dfs
- melihat type data pada setiap kolom

In [79]:
df[['duration', 'days_left', 'price']] = mm.fit_transform(df[['duration', 'days_left', 'price']])
df.head()

,airline,flight,source_city,departure_time,stops,arrival_time,destination_city,class,duration,days_left,price
0,SpiceJet,SG-8709,Delhi,Evening,zero,Night,Mumbai,Economy,0.027347,0.0,0.039749
1,SpiceJet,SG-8157,Delhi,Early_Morning,zero,Morning,Mumbai,Economy,0.030612,0.0,0.039749
2,AirAsia,I5-764,Delhi,Early_Morning,zero,Early_Morning,Mumbai,Economy,0.027347,0.0,0.039773
3,Vistara,UK-995,Delhi,Morning,zero,Afternoon,Mumbai,Economy,0.028980,0.0,0.039765
4,Vistara,UK-963,Delhi,Morning,zero,Morning,Mumbai,Economy,0.030612,0.0,0.039765

Keterangan : Melakukan Normalisasi data pada kolom duration, days_left ,price

## Encoding

### One-Hot Encoding

Lakukan one hot encoding pada dataset yang kalian miliki

In [80]:
from sklearn.preprocessing import OneHotEncoder

Keterangan : melakukan import OneHotEncoder(sklearn.preprocessing)

In [81]:
ohe = OneHotEncoder(sparse_output=False)
oh_encoded = ohe.fit_transform(df[['class', 'stops']])
encoded = pd.DataFrame(oh_encoded,columns=['Class_economy', 'Class_business', 'Stops_Zero', 'Stops_one', 'Stops_two-or-more'])
encoded.head()

   Class_economy  Class_business  Stops_Zero  Stops_one  Stops_two-or-more
0            0.0             1.0         0.0        0.0                1.0
1            0.0             1.0         0.0        0.0                1.0
2            0.0             1.0         0.0        0.0                1.0
3            0.0             1.0         0.0        0.0                1.0
4            0.0             1.0         0.0        0.0                1.0

Keterangan :
- membuat variable ohe sebagai alias fungsi OneHotEncoder(sparse_output=False)
- Melakukan one hot encoding data pada kolom class, stops lalu disimpan pada variable oh_encoded
- memberi nama kolom pada data yang sudah di lakukan OHE lalu disimpan dalam variable encoded

In [82]:
df = pd.concat([df, encoded], axis=1)
df.drop(columns=['class', 'stops'], inplace=True)
df.head()

,airline,flight,source_city,departure_time,arrival_time,destination_city,duration,days_left,price,Class_economy,Class_business,Stops_Zero,Stops_one,Stops_two-or-more
0,SpiceJet,SG-8709,Delhi,Evening,Night,Mumbai,0.027347,0.0,0.039749,0.0,1.0,0.0,0.0,1.0
1,SpiceJet,SG-8157,Delhi,Early_Morning,Morning,Mumbai,0.030612,0.0,0.039749,0.0,1.0,0.0,0.0,1.0
2,AirAsia,I5-764,Delhi,Early_Morning,Early_Morning,Mumbai,0.027347,0.0,0.039773,0.0,1.0,0.0,0.0,1.0
3,Vistara,UK-995,Delhi,Morning,Afternoon,Mumbai,0.028980,0.0,0.039765,0.0,1.0,0.0,0.0,1.0
4,Vistara,UK-963,Delhi,Morning,Morning,Mumbai,0.030612,0.0,0.039765,0.0,1.0,0.0,0.0,1.0

Keterangan :
- menggabungkan data pada dataset awal dengan data yang dilakukan encoding
- menghilangkan kolom class dan stops

## Ganti tipe data salah satu attribute angka

In [83]:
df[['Class_economy','Class_business','Stops_Zero','Stops_one','Stops_two-or-more']] = df[['Class_economy','Class_business','Stops_Zero','Stops_one','Stops_two-or-more']].astype('boolean')
df.head()

,airline,flight,source_city,departure_time,arrival_time,destination_city,duration,days_left,price,Class_economy,Class_business,Stops_Zero,Stops_one,Stops_two-or-more
0,SpiceJet,SG-8709,Delhi,Evening,Night,Mumbai,0.027347,0.0,0.039749,False,True,False,False,True
1,SpiceJet,SG-8157,Delhi,Early_Morning,Morning,Mumbai,0.030612,0.0,0.039749,False,True,False,False,True
2,AirAsia,I5-764,Delhi,Early_Morning,Early_Morning,Mumbai,0.027347,0.0,0.039773,False,True,False,False,True
3,Vistara,UK-995,Delhi,Morning,Afternoon,Mumbai,0.028980,0.0,0.039765,False,True,False,False,True
4,Vistara,UK-963,Delhi,Morning,Morning,Mumbai,0.030612,0.0,0.039765,False,True,False,False,True

Keterangan :
Mengubah representasi tipe data boolean pada data yang dilakukan OHE yang sebelumnya dalam bentuk 1 dan 0 menjadi true dan false

## Split Data

Bagi dataset menjadi training set dan testing set dengan proporsi 70:30

In [84]:
from sklearn.model_selection import train_test_split

Keterangan : melakukan import train_test_split(sklearn.model_selection)

In [85]:
x = df.drop(columns='price')
y = df['price']

Keterangan :
menyimpan data pada kolom label pada variable y dan kolom selain label pada variable x

In [86]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.3, random_state=12)

keterangan : melakukan split data dengan banyak data test 30%

In [87]:
print(x_train.shape)
print(x_test.shape)
print(y_train.shape)
print(y_test.shape)

(210107, 13)
(90046, 13)
(210107,)
(90046,)

Keterangan : melihat banyak baris dan kolom pada setiap variable split